trade_exp/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТипыНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>МногооборотнаяТара</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Товар</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Работа</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Набор</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/CommonModules/РозничныеПродажиКлиентСервер/Module.bsl
&ИзменениеИКонтроль("ДоступныеВидыОплаты")
Функция Док_ДоступныеВидыОплаты(Форма) Экспорт
	
	ДоступныеВидыОплаты = Новый Структура;
	ДоступныеВидыОплаты.Вставить("Наличные",              Ложь);
	ДоступныеВидыОплаты.Вставить("ПлатежныеКарты",        Ложь);
	ДоступныеВидыОплаты.Вставить("БонусныеБаллы",         Ложь);
	ДоступныеВидыОплаты.Вставить("ПодарочныеСертификаты", Ложь);
	
	Если ТипЗнч(Форма.Объект.Ссылка) = Тип("ДокументСсылка.РеализацияПодарочныхСертификатов") 
			Или ТипЗнч(Форма.Объект.Ссылка) = Тип("ДокументСсылка.ЧекККМВозврат")
			Или ТипЗнч(Форма.Объект.Ссылка) = Тип("ДокументСсылка.ВозвратПодарочныхСертификатов") Тогда
		
		ОплатаПлатежнымиКартами = (Форма.ИспользоватьОплатуПлатежнымиКартами
								И Форма.ЭквайринговыеТерминалы.Количество() > 0);
		
		ДоступныеВидыОплаты.Вставить("Наличные",              Истина);
		ДоступныеВидыОплаты.Вставить("ПлатежныеКарты",        ОплатаПлатежнымиКартами);
		
	ИначеЕсли ТипЗнч(Форма.Объект.Ссылка) = Тип("ДокументСсылка.ЧекККМ") Тогда
		
		ОплатаПлатежнымиКартами = (Форма.ИспользоватьОплатуПлатежнымиКартами
								И Форма.ЭквайринговыеТерминалы.Количество() > 0);
		#Вставка	
		ОплатаБонуснымиБаллами = Истина; 
		#КонецВставки	

		#Удаление
		ОплатаБонуснымиБаллами = (Форма.ИспользоватьБонусныеПрограммыЛояльности 
								И ЗначениеЗаполнено(Форма.Объект.КартаЛояльности));
		#КонецУдаления
		
		ДоступныеВидыОплаты.Вставить("Наличные",              Истина);
		ДоступныеВидыОплаты.Вставить("ПлатежныеКарты",        ОплатаПлатежнымиКартами);
		ДоступныеВидыОплаты.Вставить("БонусныеБаллы",         ОплатаБонуснымиБаллами);
		ДоступныеВидыОплаты.Вставить("ПодарочныеСертификаты", Форма.ИспользоватьПодарочныеСертификаты);

	ИначеЕсли ТипЗнч(Форма.Объект.Ссылка) = Тип("ДокументСсылка.ОперацияПоПлатежнойКарте") Тогда
		
		ДоступныеВидыОплаты.Вставить("ПлатежныеКарты",        Форма.ИспользуютсяЭквайринговыеТерминалы);
		
	КонецЕсли;
	
	РозничныеПродажиКлиентСерверЛокализация.ДополнитьДоступныеВидыОплаты(Форма, ДоступныеВидыОплаты);

	Возврат ДоступныеВидыОплаты;
КонецФункции

&ИзменениеИКонтроль("ПризнакПредметаРасчетаФискальнойОперации")
Функция Док_ПризнакПредметаРасчетаФискальнойОперации(ТипНоменклатуры, ПодакцизныйТовар, УказанаКМ, СтрокаПозицииЧека)
		
	ВозвращаемоеЗначение = Неопределено;
	
	Если ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Работа") Тогда
		Возврат ПредопределенноеЗначение("Перечисление.ПризнакиПредметаРасчета.Работа");
	КонецЕсли;
	
	Если ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга") Тогда
		Возврат ПредопределенноеЗначение("Перечисление.ПризнакиПредметаРасчета.Услуга");
	КонецЕсли;
	
	Если ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Товар")
		И (Не УказанаКМ Или БезОсобенностейУчета(СтрокаПозицииЧека)) Тогда
		
		Если ПодакцизныйТовар Тогда
			Возврат ПредопределенноеЗначение("Перечисление.ПризнакиПредметаРасчета.ПодакцизныйТовар");
		Иначе
			Возврат ПредопределенноеЗначение("Перечисление.ПризнакиПредметаРасчета.Товар");
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Товар")
		И УказанаКМ И НЕ БезОсобенностейУчета(СтрокаПозицииЧека) Тогда
		
		ОсобенностьУчета = СтрокаПозицииЧека.ОсобенностьУчета;
		
		Если ПодакцизныйТовар Тогда
			
			Если ОбщегоНазначенияУТКлиентСервер.ЕстьРеквизитОбъекта(СтрокаПозицииЧека, "РезультатРаспределения")
				И ЗначениеЗаполнено(СтрокаПозицииЧека.РезультатРаспределения)
				И СтрокаПозицииЧека.РезультатРаспределения.ЧастичноеВыбытие Тогда
				
				ЕмкостьПотребительскойУпаковки = СтрокаПозицииЧека.РезультатРаспределения.ЕмкостьПотребительскойУпаковки;
				ЧастичноеВыбытиеКоличество = СтрокаПозицииЧека.РезультатРаспределения.ЧастичноеВыбытиеКоличество;
				
				Если ЕмкостьПотребительскойУпаковки = ЧастичноеВыбытиеКоличество Тогда
					Возврат ПредопределенноеЗначение("Перечисление.ПризнакиПредметаРасчета.ПодакцизныйТоварМаркируемыйСИИмеющийКМ");
				Иначе
					Возврат ПредопределенноеЗначение("Перечисление.ПризнакиПредметаРасчета.ПодакцизныйТоварМаркируемыйСИНеИмеющийКМ");
				КонецЕсли;
				
			ИначеЕсли ОсобенностьУчета = ПредопределенноеЗначение("Перечисление.ОсобенностиУчетаНоменклатуры.АлкогольнаяПродукция") Тогда
				
				Возврат ПредопределенноеЗначение("Перечисление.ПризнакиПредметаРасчета.ПодакцизныйТовар");
				
			Иначе
				
				Возврат ПредопределенноеЗначение("Перечисление.ПризнакиПредметаРасчета.ПодакцизныйТоварМаркируемыйСИИмеющийКМ");
				
			КонецЕсли;
			
		Иначе
			
			Если ОбщегоНазначенияУТКлиентСервер.ЕстьРеквизитОбъекта(СтрокаПозицииЧека, "РезультатРаспределения")
				И ЗначениеЗаполнено(СтрокаПозицииЧека.РезультатРаспределения)
				И СтрокаПозицииЧека.РезультатРаспределения.ЧастичноеВыбытие Тогда
				
				ЕмкостьПотребительскойУпаковки = СтрокаПозицииЧека.РезультатРаспределения.ЕмкостьПотребительскойУпаковки;
				ЧастичноеВыбытиеКоличество = СтрокаПозицииЧека.РезультатРаспределения.ЧастичноеВыбытиеКоличество;
				
				Если ЕмкостьПотребительскойУпаковки = ЧастичноеВыбытиеКоличество Тогда
					Возврат ПредопределенноеЗначение("Перечисление.ПризнакиПредметаРасчета.ТоварМаркируемыйСИИмеющийКМ");
				Иначе
					Возврат ПредопределенноеЗначение("Перечисление.ПризнакиПредметаРасчета.ТоварМаркируемыйСИНеИмеющийКМ");
				КонецЕсли;
				
			ИначеЕсли ОсобенностьУчета = ПредопределенноеЗначение("Перечисление.ОсобенностиУчетаНоменклатуры.АлкогольнаяПродукция")
				ИЛИ ОсобенностьУчета = ПредопределенноеЗначение("Перечисление.ОсобенностиУчетаНоменклатуры.ПродукцияИзНатуральногоМеха")
				ИЛИ ОсобенностьУчета = ПредопределенноеЗначение("Перечисление.ОсобенностиУчетаНоменклатуры.ПодконтрольнаяПродукцияВЕТИС")
				ИЛИ ОсобенностьУчета = ПредопределенноеЗначение("Перечисление.ОсобенностиУчетаНоменклатуры.ПодконтрольнаяПродукцияСАТУРН")
				ИЛИ ОсобенностьУчета = ПредопределенноеЗначение("Перечисление.ОсобенностиУчетаНоменклатуры.Зерно")
				ИЛИ ОсобенностьУчета = ПредопределенноеЗначение("Перечисление.ОсобенностиУчетаНоменклатуры.ЗерноВЕТИС")
				ИЛИ ОсобенностьУчета = ПредопределенноеЗначение("Перечисление.ОсобенностиУчетаНоменклатуры.ПродуктыПереработкиЗерна")
				ИЛИ ОсобенностьУчета = ПредопределенноеЗначение("Перечисление.ОсобенностиУчетаНоменклатуры.ПродуктыПереработкиЗернаВЕТИС") Тогда
				
				Возврат ПредопределенноеЗначение("Перечисление.ПризнакиПредметаРасчета.Товар");
			Иначе
				Возврат ПредопределенноеЗначение("Перечисление.ПризнакиПредметаРасчета.ТоварМаркируемыйСИИмеющийКМ");
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ВозвращаемоеЗначение = Неопределено Тогда
		ВозвращаемоеЗначение = ПредопределенноеЗначение("Перечисление.ПризнакиПредметаРасчета.Товар");
	КонецЕсли;
	Возврат ВозвращаемоеЗначение;
	
КонецФункции
